Revit 2024 API
PanelScheduleSheetInstance.GetSchedule Method
 Gets the panel schedule view.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public PanelScheduleView GetSchedule()
Visual Basic
Public Function GetSchedule As PanelScheduleView
Visual C++
public:
PanelScheduleView^ GetSchedule()
Return Value
 The panel schedule view element.
See Also
PanelScheduleSheetInstance Class
Autodesk.Revit.DB.Electrical Namespace